-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 
-- サーバのバージョン： 10.1.37-MariaDB
-- PHP Version: 7.3.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `kumiton`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `t_match`
--

CREATE TABLE `t_match` (
  `id` int(11) NOT NULL,
  `server1` varchar(32) NOT NULL COMMENT 'サーバー一人目',
  `server2` varchar(32) NOT NULL COMMENT 'サーバー二人目',
  `receiver1` varchar(32) NOT NULL COMMENT 'レシーバー一人目',
  `receiver2` varchar(32) NOT NULL COMMENT 'レシーバー二人目',
  `play_flg` tinyint(1) NOT NULL DEFAULT '1' COMMENT '1:未プレイ、2:プレイ済'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='試合の組み合わせを格納';

--
-- テーブルのデータのダンプ `t_match`
--

INSERT INTO `t_match` (`id`, `server1`, `server2`, `receiver1`, `receiver2`, `play_flg`) VALUES
(1, '平山智子', '吉崎広太', '藤井義博', 'タケさん', 1),
(2, '平山智子', '吉崎広太', '藤井義博', '田頭あゆ', 1),
(3, '平山智子', '吉崎広太', '藤井義博', '明日香', 1),
(4, '平山智子', '吉崎広太', '藤井義博', '山本真稀', 1),
(5, '平山智子', '吉崎広太', '吉岡みかこ', 'タケさん', 1),
(6, '平山智子', '吉崎広太', '吉岡みかこ', '田頭あゆ', 1),
(7, '平山智子', '吉崎広太', '吉岡みかこ', '明日香', 1),
(8, '平山智子', '吉崎広太', '吉岡みかこ', '山本真稀', 1),
(9, '藤井義博', 'タケさん', '平山智子', '田頭あゆ', 1),
(10, '藤井義博', 'タケさん', '平山智子', '明日香', 1),
(11, '藤井義博', 'タケさん', '平山智子', '山本真稀', 1),
(12, '藤井義博', 'タケさん', '吉岡みかこ', '吉崎広太', 1),
(13, '藤井義博', 'タケさん', '吉岡みかこ', '田頭あゆ', 1),
(14, '藤井義博', 'タケさん', '吉岡みかこ', '明日香', 1),
(15, '藤井義博', 'タケさん', '吉岡みかこ', '山本真稀', 1),
(16, '藤井義博', '吉崎広太', '平山智子', 'タケさん', 1),
(17, '藤井義博', '吉崎広太', '平山智子', '田頭あゆ', 1),
(18, '藤井義博', '吉崎広太', '平山智子', '明日香', 1),
(19, '藤井義博', '吉崎広太', '平山智子', '山本真稀', 1),
(20, '藤井義博', '吉崎広太', '吉岡みかこ', 'タケさん', 1),
(21, '藤井義博', '吉崎広太', '吉岡みかこ', '田頭あゆ', 1),
(22, '藤井義博', '吉崎広太', '吉岡みかこ', '明日香', 1),
(23, '藤井義博', '吉崎広太', '吉岡みかこ', '山本真稀', 1),
(24, '藤井義博', '田頭あゆ', '平山智子', 'タケさん', 1),
(25, '藤井義博', '田頭あゆ', '平山智子', '明日香', 1),
(26, '藤井義博', '田頭あゆ', '平山智子', '山本真稀', 1),
(27, '藤井義博', '田頭あゆ', '吉岡みかこ', 'タケさん', 1),
(28, '藤井義博', '田頭あゆ', '吉岡みかこ', '吉崎広太', 1),
(29, '藤井義博', '田頭あゆ', '吉岡みかこ', '明日香', 1),
(30, '藤井義博', '田頭あゆ', '吉岡みかこ', '山本真稀', 1),
(31, '藤井義博', '明日香', '平山智子', 'タケさん', 1),
(32, '藤井義博', '明日香', '平山智子', '田頭あゆ', 1),
(33, '藤井義博', '明日香', '平山智子', '山本真稀', 1),
(34, '藤井義博', '明日香', '吉岡みかこ', 'タケさん', 1),
(35, '藤井義博', '明日香', '吉岡みかこ', '吉崎広太', 1),
(36, '藤井義博', '明日香', '吉岡みかこ', '田頭あゆ', 1),
(37, '藤井義博', '明日香', '吉岡みかこ', '山本真稀', 1),
(38, '藤井義博', '山本真稀', '平山智子', 'タケさん', 1),
(39, '藤井義博', '山本真稀', '平山智子', '田頭あゆ', 1),
(40, '藤井義博', '山本真稀', '平山智子', '明日香', 1),
(41, '藤井義博', '山本真稀', '吉岡みかこ', 'タケさん', 1),
(42, '藤井義博', '山本真稀', '吉岡みかこ', '吉崎広太', 1),
(43, '藤井義博', '山本真稀', '吉岡みかこ', '田頭あゆ', 1),
(44, '藤井義博', '山本真稀', '吉岡みかこ', '明日香', 1),
(45, '平山智子', 'タケさん', '吉岡みかこ', '吉崎広太', 1),
(46, '平山智子', 'タケさん', '吉岡みかこ', '田頭あゆ', 1),
(47, '平山智子', 'タケさん', '吉岡みかこ', '明日香', 1),
(48, '平山智子', 'タケさん', '吉岡みかこ', '山本真稀', 1),
(49, '平山智子', '田頭あゆ', '吉岡みかこ', 'タケさん', 1),
(50, '平山智子', '田頭あゆ', '吉岡みかこ', '吉崎広太', 1),
(51, '平山智子', '田頭あゆ', '吉岡みかこ', '明日香', 1),
(52, '平山智子', '田頭あゆ', '吉岡みかこ', '山本真稀', 1),
(53, '平山智子', '明日香', '吉岡みかこ', 'タケさん', 1),
(54, '平山智子', '明日香', '吉岡みかこ', '吉崎広太', 1),
(55, '平山智子', '明日香', '吉岡みかこ', '田頭あゆ', 1),
(56, '平山智子', '明日香', '吉岡みかこ', '山本真稀', 1),
(57, '平山智子', '山本真稀', '吉岡みかこ', 'タケさん', 1),
(58, '平山智子', '山本真稀', '吉岡みかこ', '吉崎広太', 1),
(59, '平山智子', '山本真稀', '吉岡みかこ', '田頭あゆ', 1),
(60, '平山智子', '山本真稀', '吉岡みかこ', '明日香', 1),
(61, '山本真稀', 'タケさん', '田頭あゆ', '吉崎広太', 1),
(62, '山本真稀', 'タケさん', '明日香', '吉崎広太', 1),
(63, '山本真稀', 'タケさん', '明日香', '田頭あゆ', 1),
(64, '山本真稀', 'タケさん', '藤井義博', '雨林綾花', 1),
(65, '山本真稀', 'タケさん', '平山智子', '中下敬識', 1),
(66, '山本真稀', 'タケさん', '吉岡みかこ', '雨林綾花', 1),
(67, '山本真稀', 'タケさん', '吉岡みかこ', '中下敬識', 1),
(68, '山本真稀', 'タケさん', '平山智子', '雨林綾花', 1),
(69, '山本真稀', 'タケさん', '藤井義博', '中下敬識', 1),
(70, '田頭あゆ', 'タケさん', '明日香', '吉崎広太', 1),
(71, '田頭あゆ', 'タケさん', '藤井義博', '雨林綾花', 1),
(72, '田頭あゆ', 'タケさん', '山本真稀', '吉崎広太', 1),
(73, '田頭あゆ', 'タケさん', '平山智子', '中下敬識', 1),
(74, '田頭あゆ', 'タケさん', '吉岡みかこ', '雨林綾花', 1),
(75, '田頭あゆ', 'タケさん', '吉岡みかこ', '中下敬識', 1),
(76, '田頭あゆ', 'タケさん', '平山智子', '雨林綾花', 1),
(77, '田頭あゆ', 'タケさん', '藤井義博', '中下敬識', 1),
(78, '田頭あゆ', 'タケさん', '山本真稀', '明日香', 1),
(79, '田頭あゆ', '吉崎広太', '明日香', 'タケさん', 1),
(80, '田頭あゆ', '吉崎広太', '藤井義博', '雨林綾花', 1),
(81, '田頭あゆ', '吉崎広太', '平山智子', '中下敬識', 1),
(82, '田頭あゆ', '吉崎広太', '吉岡みかこ', '雨林綾花', 1),
(83, '田頭あゆ', '吉崎広太', '吉岡みかこ', '中下敬識', 1),
(84, '田頭あゆ', '吉崎広太', '平山智子', '雨林綾花', 1),
(85, '田頭あゆ', '吉崎広太', '藤井義博', '中下敬識', 1),
(86, '田頭あゆ', '吉崎広太', '山本真稀', '明日香', 1),
(87, '明日香', 'タケさん', '藤井義博', '雨林綾花', 1),
(88, '明日香', 'タケさん', '山本真稀', '吉崎広太', 1),
(89, '明日香', 'タケさん', '平山智子', '中下敬識', 1),
(90, '明日香', 'タケさん', '吉岡みかこ', '雨林綾花', 1),
(91, '明日香', 'タケさん', '吉岡みかこ', '中下敬識', 1),
(92, '明日香', 'タケさん', '山本真稀', '田頭あゆ', 1),
(93, '明日香', 'タケさん', '平山智子', '雨林綾花', 1),
(94, '明日香', 'タケさん', '藤井義博', '中下敬識', 1),
(95, '吉崎広太', 'タケさん', '明日香', '田頭あゆ', 1),
(96, '吉崎広太', 'タケさん', '藤井義博', '雨林綾花', 1),
(97, '吉崎広太', 'タケさん', '平山智子', '中下敬識', 1),
(98, '吉崎広太', 'タケさん', '吉岡みかこ', '雨林綾花', 1),
(99, '吉崎広太', 'タケさん', '吉岡みかこ', '中下敬識', 1),
(100, '吉崎広太', 'タケさん', '山本真稀', '田頭あゆ', 1),
(101, '吉崎広太', 'タケさん', '平山智子', '雨林綾花', 1),
(102, '吉崎広太', 'タケさん', '藤井義博', '中下敬識', 1),
(103, '吉崎広太', 'タケさん', '山本真稀', '明日香', 1),
(104, '明日香', '吉崎広太', '藤井義博', '雨林綾花', 1),
(105, '明日香', '吉崎広太', '平山智子', '中下敬識', 1),
(106, '明日香', '吉崎広太', '吉岡みかこ', '雨林綾花', 1),
(107, '明日香', '吉崎広太', '吉岡みかこ', '中下敬識', 1),
(108, '明日香', '吉崎広太', '山本真稀', '田頭あゆ', 1),
(109, '明日香', '吉崎広太', '平山智子', '雨林綾花', 1),
(110, '明日香', '吉崎広太', '藤井義博', '中下敬識', 1),
(111, '明日香', '田頭あゆ', '藤井義博', '雨林綾花', 1),
(112, '明日香', '田頭あゆ', '山本真稀', '吉崎広太', 1),
(113, '明日香', '田頭あゆ', '平山智子', '中下敬識', 1),
(114, '明日香', '田頭あゆ', '吉岡みかこ', '雨林綾花', 1),
(115, '明日香', '田頭あゆ', '吉岡みかこ', '中下敬識', 1),
(116, '明日香', '田頭あゆ', '平山智子', '雨林綾花', 1),
(117, '明日香', '田頭あゆ', '藤井義博', '中下敬識', 1),
(118, '藤井義博', '雨林綾花', '山本真稀', '吉崎広太', 1),
(119, '藤井義博', '雨林綾花', '平山智子', '中下敬識', 1),
(120, '藤井義博', '雨林綾花', '吉岡みかこ', '中下敬識', 1),
(121, '藤井義博', '雨林綾花', '山本真稀', '田頭あゆ', 1),
(122, '藤井義博', '雨林綾花', '山本真稀', '明日香', 1),
(123, '山本真稀', '吉崎広太', '平山智子', '中下敬識', 1),
(124, '山本真稀', '吉崎広太', '吉岡みかこ', '雨林綾花', 1),
(125, '山本真稀', '吉崎広太', '吉岡みかこ', '中下敬識', 1),
(126, '山本真稀', '吉崎広太', '平山智子', '雨林綾花', 1),
(127, '山本真稀', '吉崎広太', '藤井義博', '中下敬識', 1),
(128, '平山智子', '中下敬識', '吉岡みかこ', '雨林綾花', 1),
(129, '平山智子', '中下敬識', '山本真稀', '田頭あゆ', 1),
(130, '平山智子', '中下敬識', '山本真稀', '明日香', 1),
(131, '吉岡みかこ', '雨林綾花', '山本真稀', '田頭あゆ', 1),
(132, '吉岡みかこ', '雨林綾花', '藤井義博', '中下敬識', 1),
(133, '吉岡みかこ', '雨林綾花', '山本真稀', '明日香', 1),
(134, '吉岡みかこ', '中下敬識', '山本真稀', '田頭あゆ', 1),
(135, '吉岡みかこ', '中下敬識', '平山智子', '雨林綾花', 1),
(136, '吉岡みかこ', '中下敬識', '山本真稀', '明日香', 1),
(137, '山本真稀', '田頭あゆ', '平山智子', '雨林綾花', 1),
(138, '山本真稀', '田頭あゆ', '藤井義博', '中下敬識', 1),
(139, '平山智子', '雨林綾花', '藤井義博', '中下敬識', 1),
(140, '平山智子', '雨林綾花', '山本真稀', '明日香', 1),
(141, '藤井義博', '中下敬識', '山本真稀', '明日香', 1),
(142, '明日香', '雨林綾花', '山本真稀', '中下敬識', 1),
(143, '明日香', '雨林綾花', '田頭あゆ', '中下敬識', 1),
(144, '明日香', '雨林綾花', '吉崎広太', '中下敬識', 1),
(145, '明日香', '雨林綾花', 'タケさん', '中下敬識', 1),
(146, '明日香', '中下敬識', '田頭あゆ', '雨林綾花', 1),
(147, '明日香', '中下敬識', '山本真稀', '雨林綾花', 1),
(148, '明日香', '中下敬識', '吉崎広太', '雨林綾花', 1),
(149, '明日香', '中下敬識', 'タケさん', '雨林綾花', 1),
(150, '山本真稀', '中下敬識', '田頭あゆ', '雨林綾花', 1),
(151, '山本真稀', '中下敬識', '吉崎広太', '雨林綾花', 1),
(152, '山本真稀', '中下敬識', 'タケさん', '雨林綾花', 1),
(153, '田頭あゆ', '雨林綾花', '吉崎広太', '中下敬識', 1),
(154, '田頭あゆ', '雨林綾花', 'タケさん', '中下敬識', 1),
(155, '田頭あゆ', '中下敬識', '山本真稀', '雨林綾花', 1),
(156, '田頭あゆ', '中下敬識', '吉崎広太', '雨林綾花', 1),
(157, '田頭あゆ', '中下敬識', 'タケさん', '雨林綾花', 1),
(158, '山本真稀', '雨林綾花', '吉崎広太', '中下敬識', 1),
(159, '山本真稀', '雨林綾花', 'タケさん', '中下敬識', 1),
(160, '吉崎広太', '雨林綾花', 'タケさん', '中下敬識', 1),
(161, '吉崎広太', '中下敬識', 'タケさん', '雨林綾花', 1);

-- --------------------------------------------------------

--
-- テーブルの構造 `t_member`
--

CREATE TABLE `t_member` (
  `deleted` tinyint(1) NOT NULL DEFAULT '0',
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `name_kana` varchar(64) DEFAULT NULL,
  `nickname` varchar(64) DEFAULT NULL,
  `sex` smallint(6) NOT NULL,
  `level` decimal(3,1) NOT NULL,
  `join_cnt` int(11) NOT NULL DEFAULT '0',
  `last_join_date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `t_member`
--

INSERT INTO `t_member` (`deleted`, `id`, `name`, `name_kana`, `nickname`, `sex`, `level`, `join_cnt`, `last_join_date`) VALUES
(0, 1, '北岡誠起', NULL, NULL, 1, '2.0', 0, NULL),
(0, 2, '吉岡みかこ', NULL, NULL, 2, '3.0', 0, NULL),
(0, 3, '平山智子', NULL, NULL, 2, '3.0', 0, NULL),
(0, 4, '藤井義博', NULL, NULL, 1, '3.0', 0, NULL),
(0, 5, '山本真稀', NULL, NULL, 2, '4.0', 0, NULL),
(0, 6, '明日香', NULL, NULL, 2, '4.0', 0, NULL),
(0, 7, '田頭あゆ', NULL, NULL, 2, '4.0', 0, NULL),
(0, 8, '吉崎広太', NULL, NULL, 1, '4.0', 0, NULL),
(0, 9, 'タケさん', NULL, NULL, 1, '4.0', 0, NULL),
(0, 10, '中下敬識', NULL, NULL, 1, '5.0', 0, NULL),
(0, 11, '雨林綾花', NULL, NULL, 2, '5.0', 0, NULL),
(0, 12, 'はるき', NULL, NULL, 2, '6.0', 0, NULL),
(0, 13, '加藤大', NULL, NULL, 2, '7.0', 0, NULL),
(0, 14, '仲田秀平', NULL, NULL, 2, '7.0', 0, NULL),
(0, 15, '大田先生', NULL, NULL, 2, '8.0', 0, NULL),
(0, 16, '山下もとき', NULL, NULL, 2, '8.0', 0, NULL),
(0, 17, '加藤裕喜', NULL, NULL, 2, '10.0', 0, NULL),
(0, 18, '上田さん', NULL, NULL, 2, '7.0', 0, NULL),
(0, 19, '中川剛志', NULL, NULL, 1, '8.0', 0, NULL),
(0, 20, '上田さん', NULL, NULL, 2, '7.0', 0, NULL),
(0, 21, '中川剛志', NULL, NULL, 1, '8.0', 0, NULL),
(0, 22, '西田真弓', NULL, NULL, 2, '7.0', 0, NULL),
(0, 23, '西田真弓', NULL, NULL, 2, '7.0', 0, NULL),
(0, 24, '西田真弓', NULL, NULL, 2, '7.0', 0, NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `t_match`
--
ALTER TABLE `t_match`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `t_member`
--
ALTER TABLE `t_member`
  ADD PRIMARY KEY (`id`),
  ADD KEY `name` (`name`(191));

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `t_match`
--
ALTER TABLE `t_match`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=162;

--
-- AUTO_INCREMENT for table `t_member`
--
ALTER TABLE `t_member`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
